/******************************************************************************
 *       Project: AcceleratedCPP
 * (c) Copyright: 2014
 *       Company: Home
 *                All rights reserved
 * Secrecy Level: PUBLIC
 *****************************************************************************/

/**
 *    @file       main.cpp
 *    @author     VShilenkov
 *    @brief      Параграф 00. Упражнение 08. Страница 028.
 *
 *    А об этой?
 *
 *    @see        Эффективное программирование на C++.
 *    @see        Практическое программирование на примерах.
 *    @see        Эндрю Кёниг, Барбара Му. 2002.
 */
 
/**
 *   Version history:
 *
 *   2014-12-23   0.1.0   VShilenkov   Initial
 */

#include <iostream>
int main()
{
// Этот коментарий может занимать несколько строк, благодаря
// использованию символово // в начале каждой строки вместо
// символов /* и */, служащих для ограничения многострочных
// коментариев.
std::cout << "Этот вариант программы будет работать?" << std::endl;
return 0;
}